{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_ids": {"name": "input_ids:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}, {"size": "32000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/ExpandDims", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/ExpandDims", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32000"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_3/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_0_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_0_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_3/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_1_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_1_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_1_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_1_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_1_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/saida_vocab_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/saida_vocab_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_ids", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/ExpandDims"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/ExpandDims"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/Less", "op": "Less", "input": ["input_ids", "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/add", "op": "AddV2", "input": ["input_ids", "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/Less", "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/add", "input_ids"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/SelectV2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/token_embedding_1/GatherV2", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Reshape_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Reshape_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Reshape_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/key_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/query_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_3", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/value_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_3/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/Mul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_1"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_2", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/ExpandDims", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/Softmax", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/softmax_12_1/Mul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_3"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_4", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/MatMul_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_4/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/transpose_4", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/Reshape", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/Reshape_1"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_0_1/attention_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/SquaredDifference", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/moments/variance", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/Rsqrt", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/Neg", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/mul_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/mul_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_0_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_0_1/Relu", "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_0_1/Cast/ReadVariableOp"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_0_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_0_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_0_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_0_1/add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense2_0_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/SquaredDifference", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/moments/variance", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/Rsqrt", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/Neg", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/mul_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/mul_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Reshape_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Reshape_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Reshape_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/key_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/query_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_3", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/value_1/Add", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_3/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/Mul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_1"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_2", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/ExpandDims", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/Softmax", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/softmax_13_1/Mul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_3"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_4", "op": "Transpose", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/MatMul_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_4/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/transpose_4", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/Reshape", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/Reshape_1"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/MatMul", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm2_0_1/add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/attention_1_1/attention_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_3", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_3", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/SquaredDifference", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/moments/variance", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/Rsqrt", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/Neg", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/Add_3", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/mul_1", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/mul_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_1_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/Transformer_Decoder_Web_1/norm1_1_1/add_2", "StatefulPartitionedCall/Transformer_Decoder_Web_1/ffn_dense1_1_1/Cast/ReadVariableOp"], "attr": {"adj_x": {"b": false}, 